GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_pgl.h
/**
  * @brief    LUT0 input mask disable
  * @rmtoll   CFGR0    MASK    FL_PGL_DisableLUTInputMask
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_PGL_INPUT0
  *           @arg @ref FL_PGL_INPUT1
  *           @arg @ref FL_PGL_INPUT2
  *           @arg @ref FL_PGL_INPUT3
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_DisableLUTInputMask(PGL_Type *PGLx, uint32_t LUTx, uint32_t channel)
{
    switch(LUTx)
    {
        case FL_PGL_LUT0:
            CLEAR_BIT(PGLx->CFGR0, ((channel & 0xf) << 0x0U));
            break;
        case FL_PGL_LUT1:
            CLEAR_BIT(PGLx->CFGR1, ((channel & 0xf) << 0x0U));
            break;
        case FL_PGL_LUT2:
            CLEAR_BIT(PGLx->CFGR2, ((channel & 0xf) << 0x0U));
            break;
        case FL_PGL_LUT3:
            CLEAR_BIT(PGLx->CFGR3, ((channel & 0xf) << 0x0U));
            break;
        default:
           // CLEAR_BIT(PGLx->CFGR0, ((0x0U & 0xf) << 0x0U));
            break;
    }
}

/**
  * @brief    LUT interrupt enable
  * @rmtoll   IER    LUTIE    FL_PGL_EnableIT_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_EnableIT_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    SET_BIT(PGLx->IER, ((LUTx & 0x1) << 0x0U));
}

/**
  * @brief    Get LUT interrupt enable status
  * @rmtoll   IER    LUTIE    FL_PGL_IsEnabledIT_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PGL_IsEnabledIT_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    return (uint32_t)(READ_BIT(PGLx->IER, ((LUTx & 0x1) << 0x0U)) == ((LUTx & 0x1) << 0x0U));
}

/**
  * @brief    LUT interrupt disable
  * @rmtoll   IER    LUTIE    FL_PGL_DisableIT_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_DisableIT_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    CLEAR_BIT(PGLx->IER, ((LUTx & 0x1) << 0x0U));
}

/**
  * @brief    Get LUT interrupt flag
  * @rmtoll   ISR    LUTIF    FL_PGL_IsActiveFlag_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_PGL_IsActiveFlag_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    return (uint32_t)(READ_BIT(PGLx->ISR, ((LUTx & 0x1) << 0x0U)) == ((LUTx & 0x1) << 0x0U));
}

/**
  * @brief    Clear LUT interrupt flag
  * @rmtoll   ISR    LUTIF    FL_PGL_ClearFlag_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_ClearFlag_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    WRITE_REG(PGLx->ISR, ((LUTx & 0x1) << 0x0U));
}

/**
  * @brief    Set LUT0 truth table
  * @rmtoll   LUT        FL_PGL_WriteLUTTruthTable
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @param    truth
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_WriteLUTTruthTable(PGL_Type *PGLx, uint32_t LUTx, uint32_t truth)
{
    switch(LUTx)
    {
        case FL_PGL_LUT0:
            MODIFY_REG(PGLx->LUT0, (0xffffU << 0U), (truth << 0U));
            break;
        case FL_PGL_LUT1:
            MODIFY_REG(PGLx->LUT1, (0xffffU << 0U), (truth << 0U));
            break;
        case FL_PGL_LUT2:
            MODIFY_REG(PGLx->LUT2, (0xffffU << 0U), (truth << 0U));
            break;
        case FL_PGL_LUT3:
            MODIFY_REG(PGLx->LUT3, (0xffffU << 0U), (truth << 0U));
            break;
        default:
          //  MODIFY_REG(PGLx->LUT0, (0xffffU << 0U), (0x0U << 0U));
            break;
    }
}

/**
  * @brief    Get LUT0 truth table
  * @rmtoll   LUT        FL_PGL_ReadLUTTruthTable
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval
  */
__STATIC_INLINE uint32_t FL_PGL_ReadLUTTruthTable(PGL_Type *PGLx, uint32_t LUTx)
{
    uint32_t truth = 0;
    switch(LUTx)
    {
        case FL_PGL_LUT0:
            truth = (uint32_t)(READ_BIT((PGLx->LUT0), 0xffffU) >> 0U);
            break;
        case FL_PGL_LUT1:
            truth = (uint32_t)(READ_BIT((PGLx->LUT1), 0xffffU) >> 0U);
            break;
        case FL_PGL_LUT2:
            truth = (uint32_t)(READ_BIT((PGLx->LUT2), 0xffffU) >> 0U);
            break;
        case FL_PGL_LUT3:
            truth = (uint32_t)(READ_BIT((PGLx->LUT3), 0xffffU) >> 0U);
            break;
        default:
            truth = 0;
            break;
    }
    return truth;
}

/**
  * @}
  */

/** @defgroup PGL_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_PGL_DeInit(PGL_Type *PGLx);
FL_ErrorStatus FL_PGL_LUT_Init(PGL_Type *PGLx, uint32_t LUTx, FL_PGL_InitTypeDef *lutInit);
void FL_PGL_StructInit(FL_PGL_InitTypeDef *PGL_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LR0XX_FL_PGL_H*/


/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
